---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ExternalApplicationException
source: html/dd9fe66c-2426-1fe1-ca8b-8e4afcdaedca.htm
---
# ExternalApplicationException Members

Retrieves data needed to serialize the target object.